README.org
:PROPERTIES:
:header-args:emacs-lisp: :tangle listex.el :results none
:END:
#+title: LisTeX
#+author: Alejandro Gallo

* Introduction

This packages comes from the ocasional frustration of writing
latex in =org-mode= and having a sane default formating
of the equations. Also it comes from the lack of frustration
formating and writing s-expressions in Lisp.
Let's say, it originates in a "frustration transfer".

This package is written as a literate program cite:knuth.
If you want to contribute please consider writing in the style of the document.

You can see a rendered version of this document [[https://alejandrogallo.github.io/listex][here]].

** TODO What is to be done

- Some real world testing
  - to find bugs
  - to finalize the DSL, right now I think it's quite
    ergonomic, but it might be wrong.
- Maybe a better way to generate macros
- Think about which rules to implement for the latex indentation.

* Prolog                                                           :noexport:
#+begin_src emacs-lisp
(require 'cl-lib)
#+end_src

* org-src blocks

In org mode we want to have easily accessible code blocks like

#+begin_src org :eval no
,#+begin_src listex :env al* :label dr-dv
(let ((d '(-mathrm d)))
  `(-frac (,d r)
          (,d v)))
,#+end_src

,#+RESULTS:
:results:
\begin{align*}
\label{dr-dv} \frac{\mathrm{d} r}{\mathrm{d} v}
\end{align*}
:end:
#+end_src


We have beyond the usual flags, the following:

- :label :: This is the latex label that should be used included
  in the expression automatically.
  Also a local lisp variable will be created with the same
  name so that one can reuse the expression somewhere else.
- :lisp-label :: Sometime we want to reuse the expression
  but we do not want a tex label, so =:lisp-label=
  sets the lisp variable to the expression as in =:label=
  but then no tex label is necessary.
- :env :: It is possible to wrap the expression in an environment
  before the expression gets rendered to latex.
  Possible values are for instance =$, $$, eq, eq*, al, al*=
  etc.



#+begin_src emacs-lisp
(defvar org-babel-default-header-args:listex '((:exports . "results")
                                               (:results . "value drawer")))

(defvar org-babel-header-args:listex '((:label . :any)
                                       (:lisp-label . :any)
                                       (:env . :any))
  "listex-specific header arguments.")

(defun org-babel-execute:listex (body params)
  (labels ((maybe-symbol (key) (let ((maybe-string (cdr (assq key params))))
                                 (when maybe-string (intern maybe-string)))))
    (let* ((expr (eval (car (read-from-string body))))
           (env (maybe-symbol :env))
           (label (maybe-symbol :label))
           (lisp-label (or (maybe-symbol :lisp-label)
                           label)))
      (when lisp-label
        (message "new lisp-label defined: %s" lisp-label)
        (eval `(setq-local ,lisp-label ',expr)))
      (listex
       (if env
           `(,env ,(if label
                       `((-label ,label) ,expr)
                     expr))
         expr)))))
#+end_src

* Derived mode

We define a derived mode based on the =emacs-lisp= mode
to make it easy to edit the s-expressions with your preferred bindings.

#+begin_src emacs-lisp
(define-derived-mode listex-mode
  emacs-lisp-mode "LiSTeX"
  "Major mode for listex.
\\{listex-mode-map}")
#+end_src

* Main implementation

This package has the following concepts:

- [[command][command]] ::
  This should be the equivalent to latex commands, i.e.,
  if =cmd= is a latex command of 3 variables, then
  elisp:(cmd a b c d e) should be rendered as

| name                  | prefix | what                             | lisp             | tex                | Rule                           |
|-----------------------+--------+----------------------------------+------------------+--------------------+--------------------------------|
| command <<command>>   | =-=    | Latex commands                   | =(-cmd a b c d)= | =\cmd{a}{b}{c}{d}= | by prefix                      |
| keyword <<keyword>>   | =/=    | Single keywords                  | =(/cmd a b c d)= | =\cmd a b c d=     | by prefix                      |
| operator <<operator>> |        | Infix inclusion                  | =(+ a b c)=      | =a + b + c=        | =listex-operator-list=         |
| tex-macro             |        | Macro returning a string         | =(^ a b)=        | =a^{b}=            | =listex-tex-macro-alias-alist= |
| atom                  |        | Convert whatever to string       | =int=            | =int=              |                                |
| list                  |        | Join elements by space           | =(a b)=          | =a b=              |                                |
| vector                |        | Will be copied as is             | =[a=5, b]=       | =[a=5, b]=         |                                |
|-----------------------+--------+----------------------------------+------------------+--------------------+--------------------------------|
| lisp-macro (TODO)   |        | Macro returning a symbol or list |                  |                    | =listex-lisp-macro-alist=      |


* Misc
#+begin_src emacs-lisp
(defvar listex-keyword-prefix "/")
(defvar listex-command-prefix "-")

(defvar listex-operator-prefix "%")
(defvar listex-operator-list '(+ * - =))

(defun listex:indentation (len)
  (eval `(concat ,@(cl-loop for i from 1 to len collect " "))))
#+end_src

* Macros definition

#+begin_src emacs-lisp
(defvar listex-tex-macro-alist nil)
(defvar listex-lisp-macro-alist nil)
;; this is for the newcmdlet macro
(defvar listex-tex-macro--alist-user nil)

(defmacro listex:addcmd (alist key fmt &rest !args)
  `(setf (alist-get ',key ,alist)
         ,(cl-etypecase fmt
            (function fmt)
            (otherwise `(lambda (args)
                         ,(if fmt
                              `(format ,fmt ,@(cl-loop
                                               for a in !args
                                               collect `(listex:render-tex
                                                         ,a)))
                            `(listex:render-tex ,@!args)))))
         ))

(defmacro listex:newcmd (key fmt &rest !args)
  `(listex:addcmd listex-tex-macro-alist
                  ,key ,fmt ,@!args))

(defmacro newcmdlet (ncmds &rest body)
  `(let (listex-tex-macro--alist-user)
     ,@(loop for cmd in ncmds
             collect
             `(listex:addcmd listex-tex-macro--alist-user
                             ,(car cmd) ,(cadr cmd)
                             ,@(cddr cmd)))
     ,@body))

;; important macros
(listex:newcmd braced "{%s}" args)
(listex:newcmd progn "%s" args)






;; left right stuff
(listex:newcmd lr "\\left%s%s\\right%s" (car args) (cddr args) (cadr args))
(listex:newcmd lrp nil `(lr \( \) ,@args))
(listex:newcmd lrs nil `(lr \[ \] ,@args))
(listex:newcmd set nil `(lr /{ /} ,@args))

;; quantum mechanics
(listex:newcmd <| nil `(lr /langle | ,@args))
(listex:newcmd |> nil `(lr | /rangle ,@args))

;; exponents
(listex:newcmd ^ "%s^{%s}" (car args) (cdr args))
(listex:newcmd _ "%s_{%s}" (car args) (cdr args))
(listex:newcmd ^_ "%s^{%s}_{%s}" (car args) (cadr args) (caddr args))
(listex:newcmd _^ "%s_{%s}^{%s}" (car args) (cadr args) (caddr args))

;; wrapping
(listex:newcmd begend "%s%s%s"
               (car args)
               (cdr args)
               (car args))
(listex:newcmd env "\\begin{%s}\n%s\n\\end{%s}"
               (car args)
               (cdr args)
               (car args))
(listex:newcmd mat nil `(env pmatrix ,@args))

;; Math environments
(listex:newcmd $ nil `(begend $ ,@args))
(listex:newcmd $$ nil `(begend $$ ,@args))
(listex:newcmd eq nil `(env equation ,@args))
(listex:newcmd eq* nil `(env equation* ,@args))
(listex:newcmd al nil `(env align ,@args))
(listex:newcmd al* nil `(env align* ,@args))

;; force newlines in the output
(listex:newcmd terpri "\n")
(listex:newcmd br "\n")
(listex:newcmd nl "\n")

;; more convoluted example
(listex:newcmd matrix
               (lambda (args)
                 (let ((rows (car args))
                       (cols (cadr args))
                       (elements (cddr args)))
                   (cl-assert (eq (length elements) (* cols rows)))
                   (listex:render-tex
                    `(env pmatrix
                          ,@(cl-loop for el in elements
                                     with i = 0
                                     with buff = nil
                                     do (push el buff)
                                     do (incf i)
                                     if (eq (% i cols) 0)
                                     do (push '\\\\ buff)
                                     and collect (reverse buff)
                                     and do (setf buff nil)
                                     else
                                     do (push '& buff)))))))
#+end_src

