README.org
* Types


#+begin_src emacs-lisp
(cl-deftype listex:keyword ()
  `(and symbol
        (satisfies ,(lambda (k)
                      (string-prefix-p listex-keyword-prefix
                                       (format "%s" k))))))

(cl-deftype listex:car-is-atom ()
  '(satisfies (lambda (expr) (atom (car expr)))))

(cl-deftype listex:command ()
  `(and list
        listex:car-is-atom
        (satisfies ,(lambda (expr)
                      (let ((name (format "%s" (car expr))))
                        (string-prefix-p listex-command-prefix
                                         name))))))

(cl-deftype listex:operator ()
  `(and list
        listex:car-is-atom
        (satisfies ,(lambda (expr)
                      (let ((name (car expr)))
                        (or (member name listex-operator-list)
                            (string-prefix-p listex-operator-prefix
                                             (format "%s" name))))))))

(defmacro listex:macro-get-fun (name)
  `(or (alist-get ,name listex-tex-macro--alist-user)
       (alist-get ,name listex-tex-macro-alist)))

(cl-deftype listex:macro ()
  `(and list
        listex:car-is-atom
        (satisfies ,(lambda (expr) (listex:macro-get-fun (car expr))))))
#+end_src

* Render
#+begin_src emacs-lisp

(defun listex:render-tex (expr)
  "Render listex DSL into latex"
  (cl-etypecase expr
    (listex:keyword (format "\\%s"
                            (string-remove-prefix listex-keyword-prefix
                                                  (symbol-name expr))))
    (listex:command
     (let* ((args (mapcar (lambda (e) (cl-etypecase e
                                        (vector e)
                                        (otherwise `(braced ,e))))
                          (cdr expr)))
            (name (format "\\%s" (string-remove-prefix listex-command-prefix
                                                      (symbol-name (car expr)))))
            (args-strings (mapcar #'listex:render-tex args))
            ;(braced-strings (mapcar #'listex:braced args-strings))
            )
       (concat name (string-join args-strings))
       ))
    (listex:operator (let* ((name (car expr))
                            (namestr (symbol-name name))
                            (op (if (> (length namestr) 1)
                                    (string-remove-prefix listex-operator-prefix
                                                          namestr)
                                  namestr)))
                      (string-join (mapcar #'listex:render-tex (cdr expr))
                                   (format " %s " op))))
    (listex:macro (let* ((args (cdr expr))
                         (name (car expr))
                         (f (listex:macro-get-fun name)))
                    (funcall f args)))
    (list (string-join (mapcar #'listex:render-tex expr) " "))
    (atom (format "%s" expr))))

(defun listex (expr)
  (listex:render-tex expr))
#+end_src

* Examples
:PROPERTIES:
:header-args:listex: :exports both
:END:

** Some equations

*** Newton
A simple equation will be

#+begin_src listex :env $$
'(= (-mathbf F)
    (m (-mathbf v)))
#+end_src

#+RESULTS:
:results:
$$\mathbf{F} = m \mathbf{v}$$
:end:

but of course you have all the power of =emacs-lisp= at your disposal,
so you can get a little more creative with how you organize
things:

#+begin_src listex :lisp-label newton :env eq :exports both
(let ((d '(-mathrm d))
      (F '(-mathbf F))
      (v '(-mathbf v))
      (p '(-mathbf p))
      (X '%\\times))
  (labels ((D (e x) `(-frac (,d ,e) (,d ,x))))
    `(= ,F
        ,(D p 't)
        (+ (,X ,(D 'm 't)
                   ,v)
           (,X m
               ,(D v 't)))
        )))
#+end_src

#+RESULTS:
:results:
\begin{equation}
\mathbf{F} = \frac{\mathrm{d} \mathbf{p}}{\mathrm{d} t} = \frac{\mathrm{d} m}{\mathrm{d} t} \times \mathbf{v} + m \times \frac{\mathrm{d} \mathbf{v}}{\mathrm{d} t}
\end{equation}
:end:

*** Coupled cluster

This example writes the cluster operator in coupled cluster theory
as an example for managing align environments.

#+begin_src listex :env al*
(labels (
         ;; mathematics and second quantization
         (Σ (idx) `(_ (/sum /limits) ,idx))
         (t (up down) `(_ (^ t ,up) ,down))
         (a (i) `(_ (-hat a) ,i))
         (á (i) `(^ ,(a i) /dagger))
         (áa (up down) `(,(mapcar #'á up)
                         ,(mapcar #'a (reverse down))))

         ;; define particles and holes
         (parts (n) (seq-take '(a b c d e f g A B C D E F G) n))
         (holes (n) (seq-take '(i j k l m n o I J K L M N O) n))

         ;; Coupled cluster term of order n
         (term (n) (let ((pow (math-power-of-2 n))
                         (abc (parts n))
                         (ijk (holes n)))
                     (list (when (> n 1) (list '-frac 1 pow))
                           (Σ `(,@abc ,@ijk))
                           (t abc ijk)
                           (áa abc ijk))))
         )
  ;; this inserts a plus and & and \\ for the align environment
  (let ((+ '%\\\\&+))

    `(%&= (-hat T)
          (,+ ,@(cl-loop for i from 1 to 10 collect (term i))
              /cdots))))
#+end_src

#+RESULTS:
:results:
\begin{align*}
\hat{T} &=  \sum \limits_{a i} t^{a}_{i} \hat{a}_{a}^{\dagger} \hat{a}_{i} \\&+ \frac{1}{4} \sum \limits_{a b i j} t^{a b}_{i j} \hat{a}_{a}^{\dagger} \hat{a}_{b}^{\dagger} \hat{a}_{j} \hat{a}_{i} \\&+ \frac{1}{8} \sum \limits_{a b c i j k} t^{a b c}_{i j k} \hat{a}_{a}^{\dagger} \hat{a}_{b}^{\dagger} \hat{a}_{c}^{\dagger} \hat{a}_{k} \hat{a}_{j} \hat{a}_{i} \\&+ \frac{1}{16} \sum \limits_{a b c d i j k l} t^{a b c d}_{i j k l} \hat{a}_{a}^{\dagger} \hat{a}_{b}^{\dagger} \hat{a}_{c}^{\dagger} \hat{a}_{d}^{\dagger} \hat{a}_{l} \hat{a}_{k} \hat{a}_{j} \hat{a}_{i} \\&+ \frac{1}{32} \sum \limits_{a b c d e i j k l m} t^{a b c d e}_{i j k l m} \hat{a}_{a}^{\dagger} \hat{a}_{b}^{\dagger} \hat{a}_{c}^{\dagger} \hat{a}_{d}^{\dagger} \hat{a}_{e}^{\dagger} \hat{a}_{m} \hat{a}_{l} \hat{a}_{k} \hat{a}_{j} \hat{a}_{i} \\&+ \frac{1}{64} \sum \limits_{a b c d e f i j k l m n} t^{a b c d e f}_{i j k l m n} \hat{a}_{a}^{\dagger} \hat{a}_{b}^{\dagger} \hat{a}_{c}^{\dagger} \hat{a}_{d}^{\dagger} \hat{a}_{e}^{\dagger} \hat{a}_{f}^{\dagger} \hat{a}_{n} \hat{a}_{m} \hat{a}_{l} \hat{a}_{k} \hat{a}_{j} \hat{a}_{i} \\&+ \frac{1}{128} \sum \limits_{a b c d e f g i j k l m n o} t^{a b c d e f g}_{i j k l m n o} \hat{a}_{a}^{\dagger} \hat{a}_{b}^{\dagger} \hat{a}_{c}^{\dagger} \hat{a}_{d}^{\dagger} \hat{a}_{e}^{\dagger} \hat{a}_{f}^{\dagger} \hat{a}_{g}^{\dagger} \hat{a}_{o} \hat{a}_{n} \hat{a}_{m} \hat{a}_{l} \hat{a}_{k} \hat{a}_{j} \hat{a}_{i} \\&+ \frac{1}{256} \sum \limits_{a b c d e f g A i j k l m n o I} t^{a b c d e f g A}_{i j k l m n o I} \hat{a}_{a}^{\dagger} \hat{a}_{b}^{\dagger} \hat{a}_{c}^{\dagger} \hat{a}_{d}^{\dagger} \hat{a}_{e}^{\dagger} \hat{a}_{f}^{\dagger} \hat{a}_{g}^{\dagger} \hat{a}_{A}^{\dagger} \hat{a}_{I} \hat{a}_{o} \hat{a}_{n} \hat{a}_{m} \hat{a}_{l} \hat{a}_{k} \hat{a}_{j} \hat{a}_{i} \\&+ \frac{1}{512} \sum \limits_{a b c d e f g A B i j k l m n o I J} t^{a b c d e f g A B}_{i j k l m n o I J} \hat{a}_{a}^{\dagger} \hat{a}_{b}^{\dagger} \hat{a}_{c}^{\dagger} \hat{a}_{d}^{\dagger} \hat{a}_{e}^{\dagger} \hat{a}_{f}^{\dagger} \hat{a}_{g}^{\dagger} \hat{a}_{A}^{\dagger} \hat{a}_{B}^{\dagger} \hat{a}_{J} \hat{a}_{I} \hat{a}_{o} \hat{a}_{n} \hat{a}_{m} \hat{a}_{l} \hat{a}_{k} \hat{a}_{j} \hat{a}_{i} \\&+ \frac{1}{1024} \sum \limits_{a b c d e f g A B C i j k l m n o I J K} t^{a b c d e f g A B C}_{i j k l m n o I J K} \hat{a}_{a}^{\dagger} \hat{a}_{b}^{\dagger} \hat{a}_{c}^{\dagger} \hat{a}_{d}^{\dagger} \hat{a}_{e}^{\dagger} \hat{a}_{f}^{\dagger} \hat{a}_{g}^{\dagger} \hat{a}_{A}^{\dagger} \hat{a}_{B}^{\dagger} \hat{a}_{C}^{\dagger} \hat{a}_{K} \hat{a}_{J} \hat{a}_{I} \hat{a}_{o} \hat{a}_{n} \hat{a}_{m} \hat{a}_{l} \hat{a}_{k} \hat{a}_{j} \hat{a}_{i} \\&+ \cdots
\end{align*}
:end:



** Latex document example

Even though =listex= is really thought for typesetting of formulas,
in principle writing documents in the style of
[[https://github.com/abo-abo/eltex][eltex]] is roughly possible, but consider just using =org= for this.
Consider also reading [[https://oremacs.com/2015/01/23/eltex/][this blog post]] if you really want to write
whole latex documents using s-expressions.

#+begin_src listex :exports code :wrap src latex
'(progn
   (-documentclass [12pt] article)
   (-usepackage hyperref)
   (env document
        (-section Introduction)
        (nl)
        (progn This document is is an example for the (-texttt LisTeX)
               domain specific language \(DSL\).
               (nl)

               You can also do inline math

               ($ (+ (^ A 5)) + 5)

               or displaystyle math

               (nl)

               ($$ (+ (^ A 5) 5)
                   .)

               )))
#+end_src

#+RESULTS:
#+begin_src latex
\documentclass[12pt]{article} \usepackage{hyperref} \begin{document}
\section{Introduction} 
 This document is is an example for the \texttt{LisTeX} domain specific language (DSL). 
 You can also do inline math $A^{5} + 5$ or displaystyle math 
 $$A^{5} + 5 .$$
\end{document}
#+end_src

#+RESULTS:
#+begin_export latex
\documentclass[12pt]{article} \usepackage{hyperref} \begin{document}
\section{Introduction} 
 This document is is an example for the \texttt{LisTeX} domain specific language (DSL). 
 You can also do inline math $A^{5} + 5$ or displaystyle math 
 $$A^{5} + 5 .$$
\end{document}
#+end_export

** A matrix macro

This is a simple but useful macro defined in the macro section:

#+begin_src listex :env $$ :lisp-label weird-matrix
'(matrix 2 3
         (-hat A) B (-dot E)
         (-tilde (-hat C)) D (_ E (matrix 2 2
                                          1 (^ (-hat /phi) /dagger)
                                          3 4)))
#+end_src

#+RESULTS:
:results:
$$\begin{pmatrix}
\hat{A} & B & \dot{E} \\ \tilde{\hat{C}} & D & E_{\begin{pmatrix}
1 & \hat{\phi}^{\dagger} \\ 3 & 4 \\
\end{pmatrix}} \\
\end{pmatrix}$$
:end:

And now imagine we want to find the \( \phi \)
and replace it with a \( \color{red}\psi \), well we can do it quite easily
since we defined a lisp reference for the above matrix called
=weird-matrix= and we can use the emacs lisp function =subst=
to find and replace in the sexp tree:

#+begin_src listex :env $$
(subst '(-textcolor red /psi)
       '/phi
       weird-matrix)
#+end_src

#+RESULTS:
:results:
$$\begin{pmatrix}
\hat{A} & B & \dot{E} \\ \tilde{\hat{C}} & D & E_{\begin{pmatrix}
1 & \hat{\textcolor{red}{\psi}}^{\dagger} \\ 3 & 4 \\
\end{pmatrix}} \\
\end{pmatrix}$$
:end:

That's not bad at all.


** TODO Newcmdlet

There should be an easy way of defining lexically macros,
but I should think about tihs.

This is what works now, however the problem is that I would not want
to have to call =listex= before the command.

#+begin_src listex :env $$
(newcmdlet ((χ "%s^{%s^{%s}}" args args args))
           (listex '(-frac (χ 5 5)
                           /varphi)))

#+end_src

#+RESULTS:
:results:
$$\frac{5 5^{5 5^{5 5}}}{\varphi}$$
:end:

