listex.el

(cl-deftype listex:keyword ()
  `(and symbol
        (satisfies ,(lambda (k)
                      (string-prefix-p listex-keyword-prefix
                                       (format "%s" k))))))

(cl-deftype listex:car-is-atom ()
  '(satisfies (lambda (expr) (atom (car expr)))))

(cl-deftype listex:command ()
  `(and list
        listex:car-is-atom
        (satisfies ,(lambda (expr)
                      (let ((name (format "%s" (car expr))))
                        (string-prefix-p listex-command-prefix
                                         name))))))

(cl-deftype listex:operator ()
  `(and list
        listex:car-is-atom
        (satisfies ,(lambda (expr)
                      (let ((name (car expr)))
                        (or (member name listex-operator-list)
                            (string-prefix-p listex-operator-prefix
                                             (format "%s" name))))))))

(defmacro listex:macro-get-fun (name)
  `(or (alist-get ,name listex-tex-macro--alist-user)
       (alist-get ,name listex-tex-macro-alist)))

(cl-deftype listex:macro ()
  `(and list
        listex:car-is-atom
        (satisfies ,(lambda (expr) (listex:macro-get-fun (car expr))))))

(defun listex:render-tex (expr)
  "Render listex DSL into latex"
  (cl-etypecase expr
    (listex:keyword (format "\\%s"
                            (string-remove-prefix listex-keyword-prefix
                                                  (symbol-name expr))))
    (listex:command
     (let* ((args (mapcar (lambda (e) (cl-etypecase e
                                        (vector e)
                                        (otherwise `(braced ,e))))
                          (cdr expr)))
            (name (format "\\%s" (string-remove-prefix listex-command-prefix
                                                      (symbol-name (car expr)))))
            (args-strings (mapcar #'listex:render-tex args))
            ;(braced-strings (mapcar #'listex:braced args-strings))
            )
       (concat name (string-join args-strings))
       ))
    (listex:operator (let* ((name (car expr))
                            (namestr (symbol-name name))
                            (op (if (> (length namestr) 1)
                                    (string-remove-prefix listex-operator-prefix
                                                          namestr)
                                  namestr)))
                      (string-join (mapcar #'listex:render-tex (cdr expr))
                                   (format " %s " op))))
    (listex:macro (let* ((args (cdr expr))
                         (name (car expr))
                         (f (listex:macro-get-fun name)))
                    (funcall f args)))
    (list (string-join (mapcar #'listex:render-tex expr) " "))
    (atom (format "%s" expr))))

(defun listex (expr)
  (listex:render-tex expr))
