README.org
* Tests                                                            :noexport:
:PROPERTIES:
:header-args:emacs-lisp: :tangle t.el
:END:
#+begin_src emacs-lisp
(defmacro assert-type (type &rest elements)
  `(dolist (expr ',elements)
     (cl-assert (cl-typep expr ',type) nil "%s is not of type %s" expr ',type)))

(defmacro assert-type! (type &rest elements)
  `(dolist (expr ',elements)
     (cl-assert (not (cl-typep expr ',type)) nil "%s is not of type %s" expr ',type)))

;; keyword
(assert-type listex:keyword /int /sum /alpha)
(assert-type! listex:keyword int sum alpha)

;; command
(assert-type listex:command
             (-math) (-mathrm d x))
(assert-type! listex:command
              (2) -mathrm ((-mathrm d) x))

;; operator
(dolist (op listex-operator-list)
  (cl-assert (cl-typep `(,op) 'listex:operator)))
(assert-type listex:operator
             (+) (-) (*)
             (%custom) (%) (%%))

;; macro
(assert-type listex:macro
             (^) (^ A) (^ A B 2)
             (_) (_ A) (_ A B))


;; rendering
(defun assert-render (alist)
  (dolist (c alist)
    (cl-destructuring-bind (str . expr) c
      (cl-assert (string= str (listex:render-tex expr))))))

(assert-render
 '(("int" . (int))
   ("pretty raw" . (pretty raw))
   ("int" . int)
   ("\\int" . /int)
   ("\\int x \\d" . (/int x /d))
   ("\\frac{A}{5}" . (-frac A 5))
   ("A % B % C" . (% A B C))
   ("A^{2}" . (^ A 2))))
#+end_src

#+RESULTS:

* Building                                                         :noexport:
** Emacs configuration

#+begin_src emacs-lisp :tangle config.el
(require 'package)

(setq package-enable-at-startup t)
(setq package-archives
      '(("gnu"   . "http://elpa.gnu.org/packages/")
        ("melpa" . "http://melpa.org/packages/"   )
        ("org"   . "http://orgmode.org/elpa/"     )))
(message "Initializing packages")
(package-initialize)

(message "Setting up use-package")
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(message "Requiring use-package")
(eval-when-compile
  (require 'use-package))

(message "requiring org")
(require 'org)

(message "up org-contrib")
(use-package org-plus-contrib
  :defer t
  :ensure t
  :config
  (setq org-src-fontify-natively t
        org-src-preserve-indentation t
        org-src-tab-acts-natively t))

(message "htmlize")
(use-package htmlize
  :defer t
  :ensure t)
#+end_src

** Makefile
:PROPERTIES:
:header-args: :comments both
:header-args:makefile: :tangle Makefile
:END:
*** Local Dependencies

This file should be used to declare the main dependencies of
the project, whereas the main =Makefile= of the project
is for main rules.

#+begin_src makefile
-include deps.mk
#+end_src

*** Local configuration

The =config.mk= file lets you override variables at build time
for your project

#+begin_src makefile
-include config.mk
#+end_src

*** Emacs
First of all we need to define the main emacs

#+begin_src makefile
EMACS_CONFIG ?= config.el
EMACS ?= emacs --batch -Q --load $(EMACS_CONFIG)
#+end_src

and we need org to tex

#+begin_src makefile

.PRECIOUS:
%.tangle.tex: %.org
	$(EMACS) $< -f org-babel-tangle

.PRECIOUS:
%.export.tex: %.org
	$(EMACS) $< -f org-latex-export-to-latex

.PRECIOUS:
%.export.html: %.org
	$(EMACS) $< -f org-html-export-to-html

.PRECIOUS:
%.export.beamer.tex: %.org
	$(EMACS) $< -f org-beamer-export-to-latex
#+end_src

*** Tectonic latex

Use tectonic to compile latex, it's easier
and you can just download it using this script
#+begin_src sh :tangle tools/install-tectonic :mkdirp t :comments none
#!/usr/bin/env bash
# author: Alejandro Gallo

bin="$HOME/bin"
url="https://github.com/tectonic-typesetting/tectonic/releases/download/tectonic%400.8.0/tectonic-0.8.0-x86_64-unknown-linux-musl.tar.gz"

mkdir -p $bin

wget -O - "$url" |
gunzip           |
tar xvf - -C$bin
#+end_src


#+begin_src makefile
TECTONIC_RERUNS ?=
%.pdf: %.tex
	$(info [TEX] $< -> $@)
	tectonic $(TECTONIC_RERUNS) $<
#+end_src


** Nix shell

If you used the nix package manager you can use the supplied
shell to compile the examples.

#+begin_src nix :tangle shell.nix
{ pkgs ? import <nixpkgs> {} }:

pkgs.mkShell rec {
  buildInputs = with pkgs; [emacs];
}

#+end_src


** Dependencies

Here are the dependencies of the document

#+begin_src makefile :tangle deps.mk
DEPS = \
listex.el t.el \

all: $(DEPS) test

.PRECIOUS:
%.html: %.org
	$(EMACS) $< -f org-html-export-to-html

test: listex.el t.el
	$(EMACS) --load listex.el --load t.el

listex.el t.el: README.org
	$(EMACS) $< -f org-babel-tangle

.PHONY: all test
#+end_src
